app/Controllers/AuthController.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('admin12345@gmail.com', 'admin12345@gmail.com', '$2y$10$8kFcaKsMzHFO449Vp9EzFufW7yNXJow9jRYD3q6ot9lwLBF6mxCzm')
---
    public function storeRegister() {
        $userModel = new UserModel();
        $data = [
            'name'     => $this->request->getVar('name'),
            'email'    => $this->request->getVar('email'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
        ];
        $userModel->save($data);