app/Controllers/AuthController.php

INSERT INTO `users` (`name`, `email`, `password`, `role`) VALUES ('rules123@gmail.com', 'rules123@gmail.com', '$2y$10$LfTpNkBTMp6JkFZGGzWxMOY54zCg2YudMwXZF06WGHTzj5ZOtDbIi', 'user')
---
    public function storeRegister()
    {
        // --- 1. VALIDATION ---
        $rules =[
            'name'     => 'required|min_length[3]',
            'email'    => 'required|valid_email|is_unique[users.email]', // Make sure email is unique
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            // If validation fails, redirect back to the form with errors
            return redirect()->to('/register')->withInput()->with('errors', $this->validator->getErrors());
        }

        // --- 2. SAVE TO DATABASE (If validation passes) ---
        $userModel = new UserModel();

        $data =[
            'name'     => $this->request->getVar('name'),
            'email'    => $this->request->getVar('email'),
            'password' => $this->request->getVar('password'), // No manual hash here, model does it
            'role'     => 'user' // Added the missing role
        ];

        // We check if the save was successful
        if ($userModel->save($data)) {