app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function index() {
        $data['users'] = $this->userModel->findAll();

INSERT INTO `users` (`name`, `email`, `password`, `role`) VALUES ('asasa', 'awasasasaassa@gmail.com', '$2y$10$/yoSUO7RNQiXe3QjcoN0muK7sOgl2hV/ep9CQE0gYeG30i0jOzz2S', 'staff')
---
    public function store() {
        // 1. Validation
        $rules = [
            'name'     => 'required|min_length[3]',
            'email'    => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'role'     => 'required'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // 2. Save Data (UserModel will handle hashing automatically)
        $this->userModel->save([
            'name'     => $this->request->getPost('name'),
            'email'    => $this->request->getPost('email'),
            'password' => $this->request->getPost('password'),
            'role'     => $this->request->getPost('role'),
        ]);

DELETE FROM `users`
WHERE `id` IN ('3')
---
    public function delete($id) {
        if ($this->userModel->delete($id)) {