app/Controllers/UserController.php

DELETE FROM `users`
WHERE `id` IN ('4')
---
    public function delete($id) {
        // Simple security check: Don't let the system delete the only remaining admin if necessary
        // (Optional logic can be added here)

        if ($this->userModel->delete($id)) {